{
  "version": "1.0.0",
  "metadata": {
    "title": "Digital Archaeology",
    "author": "Digital Archaeology Team",
    "lastUpdated": "2026-01-24"
  },
  "acts": [
    {
      "id": "act-5",
      "number": 5,
      "title": "The 8-bit Era",
      "description": "Four bits weren't enough. The 4004 could calculate, but it couldn't run real programs, couldn't address real memory, couldn't become a real computer. The 8-bit processors—8080, Z80, 6502—changed everything. Suddenly, a complete computer could cost less than a used car. The personal computer revolution was about to begin.",
      "era": "1974 - 1978",
      "cpuStage": "micro8",
      "chapters": [
        {
          "id": "chapter-5-1",
          "number": 1,
          "title": "More Bits, More Power",
          "subtitle": "Intel Corporation, Santa Clara",
          "year": "1974",
          "scenes": [
            {
              "id": "scene-5-1-1",
              "type": "narrative",
              "setting": {
                "text": "Intel Corporation, 1974. The 4004 has been a modest success, but its limitations are painfully clear. Four bits at a time. Tiny address space. Primitive instruction set. The calculator market is saturated. Something bigger is needed."
              },
              "narrative": [
                "The 4004 proved that a CPU could fit on a single chip. But four bits isn't enough for real computing. You can address 4KB of memory. You can handle numbers up to 15. Every operation requires multiple instructions.",
                "What if you doubled the data width? Eight bits gives you 256 values per byte. 64KB of addressable memory. Enough to run real programs, store real text, become a real computer.",
                "Intel is designing the 8008—eight bits, but still limited. And then the 8080: eight bits done right."
              ],
              "characters": [
                {
                  "avatar": "👨‍💻",
                  "name": "Federico Faggin",
                  "title": "Lead Designer, Intel",
                  "bio": "The chip designer who made the 4004 work now tackles the 8080. Faggin knows that success means more than just more bits—it means a complete, usable architecture that programmers can love.",
                  "stats": [
                    {
                      "label": "Goal",
                      "value": "Real computer on a chip"
                    },
                    {
                      "label": "Challenge",
                      "value": "Make 8 bits feel limitless"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Faggin",
                  "text": "The 4004 was a calculator chip that happened to be programmable. The 8080 must be a computer chip—capable of anything a minicomputer can do, at a fraction of the cost."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The jump from 4 to 8 bits was transformative: 2^4 = 16 values becomes 2^8 = 256 values. ASCII text becomes natural (one byte per character). The address bus expands to 16 bits, addressing 64KB—enough for substantial programs. Most importantly, 8 bits matches the byte, establishing the fundamental unit of computing.",
                  "codeSnippet": "// 4-bit vs 8-bit comparison\n// \n// 4-bit (4004):\n//   Data range: 0-15\n//   Address space: 4KB (12-bit)\n//   Registers: 16 × 4-bit\n// \n// 8-bit (8080):\n//   Data range: 0-255\n//   Address space: 64KB (16-bit)\n//   Registers: 7 × 8-bit + 16-bit pairs\n// \n// One byte = one ASCII character\n// Foundation of modern computing"
                }
              ],
              "nextScene": "scene-5-1-2"
            },
            {
              "id": "scene-5-1-2",
              "type": "narrative",
              "setting": {
                "text": "The 8080 design meeting. Engineers debate register counts, instruction formats, addressing modes. Every transistor matters—the chip must fit on affordable silicon."
              },
              "narrative": [
                "The 8080 will have seven 8-bit registers: A (accumulator), B, C, D, E, H, and L. But clever design lets you pair them: BC, DE, and HL become 16-bit register pairs for addressing.",
                "The instruction set expands dramatically: 78 different instructions, handling arithmetic, logic, data movement, branching, and I/O. A real computer's worth of operations.",
                "And critically: a hardware stack. The stack pointer tracks a region of memory for subroutine calls and returns. Programs can be modular, calling functions and returning cleanly."
              ],
              "technicalNotes": [
                {
                  "content": "The 8080's register architecture was influential: seven general registers that could be paired for 16-bit operations. The stack pointer enabled structured programming with CALL/RET. These patterns persisted through Z80, 8086, and even influenced the x86 architecture we use today.",
                  "codeSnippet": "// 8080 register architecture\n// \n// 8-bit registers: A, B, C, D, E, H, L\n// 16-bit pairs:    BC, DE, HL\n// Special:         SP (stack pointer)\n//                  PC (program counter)\n// \n// The stack enables:\n// CALL addr   ; Push PC, jump to addr\n// RET         ; Pop PC, return\n// PUSH BC     ; Save register pair\n// POP BC      ; Restore register pair"
                }
              ],
              "nextScene": "scene-5-1-3"
            },
            {
              "id": "scene-5-1-3",
              "type": "choice",
              "setting": {
                "text": "The 8080 is announced. But Intel isn't alone. At Zilog, former Intel engineers are designing the Z80. At MOS Technology, Chuck Peddle is creating the 6502. The 8-bit wars are beginning."
              },
              "narrative": [
                "Three philosophies emerge. Intel's 8080: powerful but complex, $360 per chip. Zilog's Z80: 8080-compatible but enhanced, with index registers and more instructions. MOS Technology's 6502: stripped-down simplicity at $25—one-fourteenth the price.",
                "Which approach will win? The answer: all of them. Different markets need different tradeoffs."
              ],
              "characters": [
                {
                  "avatar": "💡",
                  "name": "Chuck Peddle",
                  "title": "Chief Architect, 6502",
                  "bio": "The engineer who bet everything on simplicity and low cost. Peddle's 6502 had fewer registers, fewer transistors, but a $25 price that enabled the personal computer revolution.",
                  "stats": [
                    {
                      "label": "Philosophy",
                      "value": "Simple is better"
                    },
                    {
                      "label": "Impact",
                      "value": "Apple II, Commodore, Nintendo"
                    }
                  ]
                }
              ],
              "choices": [
                {
                  "id": "choice-study-8080",
                  "icon": "🔷",
                  "title": "Master the Intel 8080",
                  "description": "The industry standard. Complex but powerful. The foundation for CP/M and early business computing.",
                  "nextScene": "scene-5-1-3a"
                },
                {
                  "id": "choice-study-z80",
                  "icon": "🔶",
                  "title": "Explore the Zilog Z80",
                  "description": "The enhanced 8080. Index registers, more instructions, better interrupt handling. Powers countless systems.",
                  "nextScene": "scene-5-1-3b"
                },
                {
                  "id": "choice-study-6502",
                  "icon": "🟢",
                  "title": "Embrace the MOS 6502",
                  "description": "The people's processor. Simple, cheap, elegant. The heart of the Apple II and Commodore 64.",
                  "nextScene": "scene-5-1-3c"
                }
              ],
              "nextScene": "scene-5-1-4"
            },
            {
              "id": "scene-5-1-3a",
              "type": "dialogue",
              "setting": {
                "text": "An Intel engineering lab. The 8080 processor sits under a microscope, its intricate die pattern revealing the complexity within."
              },
              "dialogues": [
                {
                  "speaker": "Faggin",
                  "text": "The 8080 has 78 instructions. Compare that to the 4004's 46. We've added register-to-register moves, 16-bit arithmetic, and a proper stack. This is a real CPU."
                },
                {
                  "speaker": "You",
                  "text": "But $360 for a single chip? That seems expensive."
                },
                {
                  "speaker": "Faggin",
                  "text": "Consider what you're getting: 6,000 transistors, 2 MHz clock, the ability to address 64KB of memory. A minicomputer with similar capabilities costs $20,000. The 8080 is revolutionary value."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The 8080's instruction set established patterns still visible in x86 today: MOV for data movement, ADD/SUB for arithmetic, CALL/RET for subroutines. The accumulator-centric design required most operations to flow through register A.",
                  "codeSnippet": "// 8080 instruction patterns\n// \n// Data movement:\n//   MOV A, B    ; A <- B (register to accumulator)\n//   MVI A, 42h  ; A <- immediate value\n//   LDA 8000h   ; A <- memory[8000h]\n// \n// Arithmetic (accumulator-centric):\n//   ADD B       ; A <- A + B\n//   SUB C       ; A <- A - C\n//   INR A       ; A <- A + 1"
                }
              ],
              "nextScene": "scene-5-1-4"
            },
            {
              "id": "scene-5-1-3b",
              "type": "dialogue",
              "setting": {
                "text": "Zilog's design center. Faggin, now leading his own company, demonstrates the Z80's enhancements over its predecessor."
              },
              "dialogues": [
                {
                  "speaker": "Faggin",
                  "text": "The Z80 runs all 8080 software unchanged. But we've added index registers IX and IY for easier array access, shadow registers for instant context switching, and block instructions for memory operations."
                },
                {
                  "speaker": "You",
                  "text": "Shadow registers? Two sets of registers in one chip?"
                },
                {
                  "speaker": "Faggin",
                  "text": "Exactly. EXX swaps BC, DE, HL with their shadows in a single instruction. Perfect for interrupt handlers—save context instantly, do your work, swap back. No pushing and popping."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The Z80's most innovative feature was its shadow register set. With EXX and EX AF,AF', programmers could instantly preserve and restore state. The LDIR instruction (block move) copied BC bytes from HL to DE automatically—a single instruction replacing a loop.",
                  "codeSnippet": "// Z80 innovations\n// \n// Index registers:\n//   LD A, (IX+5)  ; Load from array at offset 5\n// \n// Block operations:\n//   LDIR          ; Copy BC bytes from HL to DE\n//   CPIR          ; Search for A in memory\n// \n// Shadow swap:\n//   EXX           ; BC<->BC', DE<->DE', HL<->HL'\n//   EX AF, AF'    ; AF<->AF' (flags too!)"
                }
              ],
              "nextScene": "scene-5-1-4"
            },
            {
              "id": "scene-5-1-3c",
              "type": "dialogue",
              "setting": {
                "text": "MOS Technology's fabrication facility. Chuck Peddle holds up a 6502 chip, explaining its radical philosophy."
              },
              "dialogues": [
                {
                  "speaker": "Peddle",
                  "text": "Intel's 8080 has six general-purpose registers. The 6502 has three: A, X, and Y. But look at the price—$25 versus $360. We can sell chips to everyone."
                },
                {
                  "speaker": "You",
                  "text": "Can you do serious computing with only three registers?"
                },
                {
                  "speaker": "Peddle",
                  "text": "You use zero-page memory as extra registers. The first 256 bytes of RAM can be accessed in just two bytes—almost as fast as register operations. It's a different philosophy, but equally powerful."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The 6502's zero-page addressing mode was its secret weapon. Addresses $00-$FF could be accessed with single-byte addresses, making them functionally equivalent to registers. Clever programmers treated zero-page as 256 pseudo-registers, offsetting the architectural simplicity.",
                  "codeSnippet": "// 6502 zero-page philosophy\n// \n// Zero-page addressing (fast):\n//   LDA $10       ; Load from address $0010\n//   STA $20       ; Store to address $0020\n// \n// Indirect indexed (powerful):\n//   LDA ($10),Y   ; Load from address at $10 + Y\n// \n// Treat zero-page as registers:\n//   ptr  = $10   ; Pointer variable\n//   temp = $20   ; Temporary storage\n//   count = $21  ; Counter"
                }
              ],
              "nextScene": "scene-5-1-4"
            },
            {
              "id": "scene-5-1-4",
              "type": "challenge",
              "setting": {
                "text": "Your lab bench configures for 8-bit development. Choose your architecture and build your first significant program."
              },
              "narrative": [
                "The Micro8 combines the best ideas from this era: eight registers, a hardware stack, expanded addressing, and a complete instruction set.",
                "Build the Micro8. Experience the power of true 8-bit computing."
              ],
              "challenge": {
                "title": "BUILD THE MICRO8 CPU",
                "objectives": [
                  {
                    "id": "obj-1",
                    "text": "Implement 8 general-purpose 8-bit registers",
                    "completed": false
                  },
                  {
                    "id": "obj-2",
                    "text": "Add register pairing for 16-bit addresses",
                    "completed": false
                  },
                  {
                    "id": "obj-3",
                    "text": "Create a hardware stack with SP register",
                    "completed": false
                  },
                  {
                    "id": "obj-4",
                    "text": "Implement CALL/RET for subroutines",
                    "completed": false
                  },
                  {
                    "id": "obj-5",
                    "text": "Add PUSH/POP for register preservation",
                    "completed": false
                  },
                  {
                    "id": "obj-6",
                    "text": "Execute a program with subroutine calls",
                    "completed": false
                  }
                ]
              },
              "technicalNotes": [
                {
                  "content": "The stack revolutionized programming. Before hardware stacks, subroutine calls required storing return addresses in fixed memory locations—making recursion impossible and code reuse difficult. With a stack, programs could call functions within functions, save and restore state naturally, and become truly modular.",
                  "codeSnippet": "// Stack operations\n// \n// CALL multiply     ; Push PC, jump to multiply\n//   ... work ...    ; Function does its job\n//   RET             ; Pop PC, return to caller\n// \n// Inside the function:\n//   PUSH BC         ; Save registers we'll use\n//   PUSH DE\n//   ... compute ... \n//   POP DE          ; Restore in reverse order\n//   POP BC\n//   RET"
                }
              ],
              "nextScene": "scene-5-1-5"
            },
            {
              "id": "scene-5-1-5",
              "type": "dialogue",
              "setting": {
                "text": "Your Micro8 runs its first program: a subroutine that multiplies two 8-bit numbers. The stack holds the return address perfectly."
              },
              "dialogues": [
                {
                  "speaker": "Faggin",
                  "text": "You see? The stack changes everything. Now programs can be structured—functions calling functions, each with its own local state. This is how real software is built."
                },
                {
                  "speaker": "You",
                  "text": "But the 4004 could do subroutines too, with its 3-level hardware stack..."
                },
                {
                  "speaker": "Faggin",
                  "text": "Three levels! Try nesting more than three function calls and you overflow. The 8080's stack is limited only by memory. You can recurse, you can nest, you can build complex systems."
                }
              ],
              "narrative": [
                "The subroutine completes. The stack pointer moves up and down as functions call and return. For the first time, you can write code that feels like modern programming.",
                "But there's more to explore. The 8-bit era isn't just about registers and stacks—it's about an explosion of systems that put computing into ordinary hands."
              ]
            }
          ]
        },
        {
          "id": "chapter-5-2",
          "number": 2,
          "title": "The Altair Moment",
          "subtitle": "MITS, Albuquerque, New Mexico",
          "year": "1975",
          "scenes": [
            {
              "id": "scene-5-2-1",
              "type": "narrative",
              "setting": {
                "text": "January 1975. The cover of Popular Electronics announces 'Project Breakthrough! World's First Minicomputer Kit to Rival Commercial Models.' The Altair 8800, powered by the Intel 8080, costs $439 in kit form."
              },
              "narrative": [
                "Ed Roberts is desperate. His company, MITS, is hemorrhaging money on failed calculator kits. The Altair is a last-ditch gamble: a real computer, based on Intel's 8080, sold as a kit to hobbyists.",
                "Roberts expects to sell maybe 400 units over the product's lifetime. MITS receives 400 orders in the first month. Then 1,000. Then 10,000.",
                "The personal computer revolution has begun—in a strip mall in Albuquerque."
              ],
              "characters": [
                {
                  "avatar": "🚀",
                  "name": "Ed Roberts",
                  "title": "Founder, MITS",
                  "bio": "The man who built the machine that started it all. Roberts bet his failing company on the idea that ordinary people wanted computers. He was spectacularly right.",
                  "stats": [
                    {
                      "label": "Risk",
                      "value": "Company on the line"
                    },
                    {
                      "label": "Reward",
                      "value": "Launched an industry"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Roberts",
                  "text": "Everyone said I was crazy. A computer kit? Who would buy that? The answer is: everyone who ever dreamed of having their own computer."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The Altair 8800 had no keyboard, no display, no storage in its base configuration. Users programmed it by flipping switches on the front panel and read results from blinking lights. Yet it was a real computer—programmable, expandable, and owned by its user.",
                  "codeSnippet": "// Altair 8800 programming\n// No keyboard! Program via front panel switches:\n// \n// 1. Set address switches to location\n// 2. Press DEPOSIT\n// 3. Set data switches to opcode/data\n// 4. Press DEPOSIT NEXT\n// 5. Repeat for entire program\n// 6. Reset address to start\n// 7. Press RUN\n// \n// Read output from front panel LEDs"
                }
              ],
              "nextScene": "scene-5-2-2"
            },
            {
              "id": "scene-5-2-2",
              "type": "narrative",
              "setting": {
                "text": "A Harvard dormitory, late at night. Two students see the Popular Electronics cover and realize: someone needs to write software for this machine."
              },
              "narrative": [
                "Bill Gates and Paul Allen have been programming since high school. They see the Altair and immediately understand: the hardware is coming. Someone needs to build the software.",
                "They call Ed Roberts and claim to have a BASIC interpreter ready. They don't—not yet. But they have eight weeks to write one before their demo appointment.",
                "Working around the clock, Allen creates an 8080 simulator that runs on a PDP-10. Gates writes BASIC in assembly language, testing it on the simulator. They've never touched actual Altair hardware."
              ],
              "characters": [
                {
                  "avatar": "💼",
                  "name": "Bill Gates",
                  "title": "Harvard Student",
                  "bio": "A driven programmer who saw that software would be the key to computing's future. Gates wrote Altair BASIC with Paul Allen, then dropped out of Harvard to found Microsoft.",
                  "stats": [
                    {
                      "label": "Age",
                      "value": "19"
                    },
                    {
                      "label": "Hours coding",
                      "value": "Virtually all of them"
                    }
                  ]
                },
                {
                  "avatar": "🔧",
                  "name": "Paul Allen",
                  "title": "Programmer, MITS",
                  "bio": "Gates' partner and the architect of Microsoft BASIC's 8080 implementation. Allen built the simulator that let them develop without hardware, then flew to Albuquerque for the demo.",
                  "stats": [
                    {
                      "label": "Innovation",
                      "value": "8080 simulator on PDP-10"
                    },
                    {
                      "label": "Role",
                      "value": "First Microsoft employee at MITS"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Allen",
                  "text": "I've never actually seen an Altair. But my simulator should be cycle-accurate. If the code runs on the simulator, it should run on the real hardware. In theory."
                }
              ],
              "nextScene": "scene-5-2-3"
            },
            {
              "id": "scene-5-2-3",
              "type": "narrative",
              "setting": {
                "text": "March 1975. Paul Allen boards a plane to Albuquerque with a paper tape of their BASIC interpreter. He realizes on the flight that they forgot to write the bootstrap loader."
              },
              "narrative": [
                "The bootstrap loader—a tiny program that loads the main program into memory. Without it, the Altair can't load BASIC from paper tape.",
                "Allen writes the loader in 8080 machine code during the flight. By hand. From memory. Twenty-one bytes that will determine whether Microsoft exists.",
                "At MITS, he feeds the paper tape into the Altair. The lights blink. The teletype hums. And then: 'READY.' Altair BASIC works—on the first try, on hardware they'd never touched."
              ],
              "technicalNotes": [
                {
                  "content": "Altair BASIC fit in 4KB of RAM—an incredible feat of optimization. Gates squeezed a complete BASIC interpreter, including floating-point math, into what wouldn't hold a single icon today. This extreme efficiency was necessary when memory cost $400 per kilobyte.",
                  "codeSnippet": "// Altair BASIC specifications\n// Memory: 4KB minimum\n// Features: Variables, loops, conditionals\n// Math: Floating-point in software\n// I/O: Teletype interface\n// \n// Famous first session:\n// MEMORY SIZE? 7168 (bytes available)\n// READY\n// PRINT 2+2\n// 4"
                }
              ],
              "nextScene": "scene-5-2-4"
            },
            {
              "id": "scene-5-2-4",
              "type": "choice",
              "setting": {
                "text": "The Homebrew Computer Club meets in a Menlo Park garage. Engineers, hobbyists, and dreamers gather to share designs, swap software, and imagine the future."
              },
              "narrative": [
                "Not everyone believes in paying for software. At Homebrew, paper tapes circulate freely. Someone has a copy of Altair BASIC. Soon everyone does.",
                "Gates writes an angry 'Open Letter to Hobbyists' accusing them of theft. The hackers argue that software wants to be free.",
                "Two philosophies collide. Both will shape the industry."
              ],
              "choices": [
                {
                  "id": "choice-explore-homebrew",
                  "icon": "🔧",
                  "title": "Join the Homebrew Culture",
                  "description": "Open hardware, shared software, community innovation. The spirit that will lead to Linux and open source.",
                  "nextScene": "scene-5-2-4a"
                },
                {
                  "id": "choice-commercial-path",
                  "icon": "💰",
                  "title": "Understand the Commercial Path",
                  "description": "Software as product, intellectual property, the business model that will create trillion-dollar companies.",
                  "nextScene": "scene-5-2-4b"
                },
                {
                  "id": "choice-program-basic",
                  "icon": "📝",
                  "title": "Write BASIC Programs",
                  "description": "Experience the first personal computer programming. What could you build with 4KB of memory?",
                  "nextScene": "scene-5-2-4c"
                }
              ],
              "nextScene": "scene-5-2-5"
            },
            {
              "id": "scene-5-2-4a",
              "type": "dialogue",
              "setting": {
                "text": "The Homebrew Computer Club meeting in Menlo Park. Fifty enthusiasts crowd around tables covered with circuit boards, schematics, and tape drives."
              },
              "dialogues": [
                {
                  "speaker": "Homebrew Member",
                  "text": "Information wants to be free! We share our designs, our code, our discoveries. That's how we all learn faster. Proprietary software? That's just gatekeeping knowledge."
                },
                {
                  "speaker": "You",
                  "text": "But doesn't that hurt the people who write the software?"
                },
                {
                  "speaker": "Homebrew Member",
                  "text": "The software is built on shared knowledge—other people's ideas, public research, community help. Charging for it privatizes what should belong to everyone. Besides, the hardware is where the real money is."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The Homebrew ethic directly influenced the free software movement. Richard Stallman's GNU project and Linus Torvalds' Linux both emerged from this tradition. Today, open-source software powers most of the internet's infrastructure.",
                  "codeSnippet": "// Homebrew Computer Club principles\n// \n// 1. Share your designs freely\n// 2. Help others learn\n// 3. Hardware is a tool for exploration\n// 4. Software enables hardware\n// 5. Community > Competition\n// \n// Members included:\n// - Steve Wozniak (Apple)\n// - Steve Jobs (Apple)\n// - Jerry Lawson (game cartridges)"
                }
              ],
              "nextScene": "scene-5-2-5"
            },
            {
              "id": "scene-5-2-4b",
              "type": "dialogue",
              "setting": {
                "text": "Bill Gates' response letter has been published. The young programmer defends software as property, sparking a debate that continues today."
              },
              "dialogues": [
                {
                  "speaker": "Gates",
                  "text": "You're stealing! Paul and I spent 18-hour days for months writing that BASIC. We deserve to be paid. If software is free, who will bother writing it?"
                },
                {
                  "speaker": "You",
                  "text": "But the hobbyists argue that sharing accelerates innovation..."
                },
                {
                  "speaker": "Gates",
                  "text": "Accelerates it for whom? Hobbyists who never sell anything? Professional software requires professional investment. Without copyright protection, there's no software industry. Period."
                }
              ],
              "technicalNotes": [
                {
                  "content": "Gates' 'Open Letter to Hobbyists' (1976) articulated the commercial software position. His argument prevailed: software copyright became law, and companies like Microsoft, Adobe, and Oracle built billion-dollar businesses selling licensed software.",
                  "codeSnippet": "// Software business model evolution\n// \n// 1975: Homebrew sharing culture\n// 1976: Gates' Open Letter\n// 1980: Software copyright recognized\n// 1990s: Shrink-wrap licenses\n// 2000s: SaaS subscriptions\n// 2010s: Freemium + data monetization\n// \n// Result: Trillion-dollar software industry"
                }
              ],
              "nextScene": "scene-5-2-5"
            },
            {
              "id": "scene-5-2-4c",
              "type": "dialogue",
              "setting": {
                "text": "An Altair terminal. The cursor blinks patiently. MEMORY SIZE? 4096. READY. Your first BASIC program awaits."
              },
              "dialogues": [
                {
                  "speaker": "Instructor",
                  "text": "BASIC makes computing accessible. You don't need to know machine code—just type English-like commands. PRINT, INPUT, IF-THEN, FOR-NEXT. Start simple: print something."
                },
                {
                  "speaker": "You",
                  "text": "10 PRINT \"HELLO WORLD\"\n20 GOTO 10\n...why is it printing forever?"
                },
                {
                  "speaker": "Instructor",
                  "text": "Your first infinite loop! Press Ctrl-C to stop. Now you understand why programs need exit conditions. That's the first lesson of programming: computers do exactly what you tell them."
                }
              ],
              "technicalNotes": [
                {
                  "content": "BASIC (Beginner's All-purpose Symbolic Instruction Code) was designed in 1964 at Dartmouth to teach programming. On early PCs, BASIC was often the only language available, booting directly from ROM. An entire generation learned to program in BASIC.",
                  "codeSnippet": "// Classic BASIC program structure\n// \n// 10 REM Number guessing game\n// 20 X = INT(RND(1)*100)+1\n// 30 PRINT \"GUESS THE NUMBER (1-100)\"\n// 40 INPUT G\n// 50 IF G < X THEN PRINT \"TOO LOW\": GOTO 40\n// 60 IF G > X THEN PRINT \"TOO HIGH\": GOTO 40\n// 70 PRINT \"CORRECT IN \"; T; \" TRIES\"\n// 80 END"
                }
              ],
              "nextScene": "scene-5-2-5"
            },
            {
              "id": "scene-5-2-5",
              "type": "challenge",
              "setting": {
                "text": "Your lab simulates the Homebrew experience. An 8-bit machine with limited memory. What can you create?"
              },
              "narrative": [
                "The constraints of early personal computing were severe. 4KB of RAM. No disk storage. Character-based displays. Every byte precious.",
                "Yet within these constraints, programmers created games, business software, and utilities that launched an industry."
              ],
              "challenge": {
                "title": "PROGRAM IN LIMITED MEMORY",
                "objectives": [
                  {
                    "id": "obj-1",
                    "text": "Write a program that fits in 256 bytes",
                    "completed": false
                  },
                  {
                    "id": "obj-2",
                    "text": "Implement string handling without string types",
                    "completed": false
                  },
                  {
                    "id": "obj-3",
                    "text": "Create a number guessing game",
                    "completed": false
                  },
                  {
                    "id": "obj-4",
                    "text": "Optimize for space, not speed",
                    "completed": false
                  },
                  {
                    "id": "obj-5",
                    "text": "Add self-modifying code to save bytes",
                    "completed": false
                  }
                ]
              },
              "technicalNotes": [
                {
                  "content": "Early programmers used every trick to save bytes: self-modifying code, overlapping instructions, encoding data in unused opcode bits. The discipline of extreme optimization created masters who could make machines sing within severe constraints.",
                  "codeSnippet": "// Space-saving tricks (8080)\n// \n// Use register pairs as pointers:\n// LXI H, data    ; HL = address\n// MOV A, M       ; A = memory[HL]\n// INX H          ; HL++ (no need for separate counter)\n// \n// Self-modifying code:\n// addr: LDA 0000h  ; Address modified at runtime\n// ...later...\n// SHLD addr+1      ; Store new address into instruction"
                }
              ],
              "nextScene": "scene-5-2-6"
            },
            {
              "id": "scene-5-2-6",
              "type": "dialogue",
              "setting": {
                "text": "Your tiny program runs. It's simple—but it's yours, running on your simulated machine."
              },
              "dialogues": [
                {
                  "speaker": "Homebrew Member",
                  "text": "That's the magic, isn't it? You wrote something. It runs. It does what you told it to. No timesharing, no batch processing. Instant feedback."
                },
                {
                  "speaker": "You",
                  "text": "But it's so limited. 4KB barely holds anything useful."
                },
                {
                  "speaker": "Homebrew Member",
                  "text": "Today, yes. But Moore's Law is relentless. Next year we'll have 8KB. Then 16KB. Then 64KB. The constraints will relax, but the skills you learn now—efficiency, optimization, understanding the machine—those last forever."
                }
              ],
              "narrative": [
                "The Homebrew era established principles that persist: the joy of personal computing, the value of community, the tension between open and proprietary.",
                "But home-built machines from kits couldn't scale. The next step required something polished: complete systems that ordinary people could use."
              ]
            }
          ]
        },
        {
          "id": "chapter-5-3",
          "number": 3,
          "title": "The Trinity",
          "subtitle": "Consumer Electronics Show, 1977",
          "year": "1977",
          "scenes": [
            {
              "id": "scene-5-3-1",
              "type": "narrative",
              "setting": {
                "text": "Consumer Electronics Show, Chicago, January 1977. Three companies—Apple, Commodore, and Tandy—unveil complete personal computers. Not kits. Not for engineers. Machines anyone can use."
              },
              "narrative": [
                "The Apple II has color graphics—a first for personal computers. Wozniak's design is elegant: minimal chips, maximum capability. It looks like something you'd want in your home.",
                "The Commodore PET integrates everything: computer, keyboard, monitor, cassette drive. All-in-one simplicity.",
                "The TRS-80 has Radio Shack's 3,000 stores behind it. Walk into any mall and buy a computer.",
                "This is the moment personal computing becomes real."
              ],
              "characters": [
                {
                  "avatar": "🍎",
                  "name": "Steve Wozniak",
                  "title": "Co-founder, Apple Computer",
                  "bio": "The engineering genius behind the Apple II. Wozniak designed an entire computer with fewer chips than anyone thought possible, then added color graphics because he wanted to play Breakout.",
                  "stats": [
                    {
                      "label": "Innovation",
                      "value": "Color graphics, disk controller"
                    },
                    {
                      "label": "Philosophy",
                      "value": "Elegant engineering"
                    }
                  ]
                },
                {
                  "avatar": "💼",
                  "name": "Steve Jobs",
                  "title": "Co-founder, Apple Computer",
                  "bio": "The visionary who understood that computers needed to be beautiful, not just functional. Jobs pushed for a complete product: case, keyboard, power supply—something you'd be proud to own.",
                  "stats": [
                    {
                      "label": "Role",
                      "value": "Vision, marketing, business"
                    },
                    {
                      "label": "Insight",
                      "value": "Computers for the rest of us"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Wozniak",
                  "text": "The 6502 costs $25. The 8080 costs $360. I can build a complete computer for the price of the other guy's CPU chip alone."
                },
                {
                  "speaker": "Jobs",
                  "text": "People don't care about chips. They care about what they can do. Games. Learning. Home finances. The computer has to be approachable, not intimidating."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The 'Trinity of 1977' established the personal computer market. Apple II's open architecture invited expansion. PET's integration simplified setup. TRS-80's retail presence enabled discovery. Each approach found its audience.",
                  "codeSnippet": "// The 1977 Trinity specs\n// \n// Apple II (6502, $1,298)\n//   RAM: 4KB-48KB\n//   Color: 6 colors, lo-res graphics\n//   Sound: Built-in speaker\n//   Expansion: 8 slots\n// \n// Commodore PET (6502, $795)\n//   RAM: 4KB-8KB\n//   Display: Built-in 9\" monitor\n//   Storage: Built-in cassette\n// \n// TRS-80 (Z80, $600)\n//   RAM: 4KB-16KB\n//   Display: Separate monitor\n//   Distribution: 3,000 Radio Shack stores"
                }
              ],
              "nextScene": "scene-5-3-2"
            },
            {
              "id": "scene-5-3-2",
              "type": "narrative",
              "setting": {
                "text": "An Apple II sits in a suburban garage. A young girl is learning to program, typing BASIC commands and watching the screen respond."
              },
              "narrative": [
                "This is what Jobs envisioned: a computer in every home, used by ordinary people for ordinary tasks. Homework. Recipe organization. Budgeting.",
                "But software makes the hardware sing. And the killer app—the program that justifies the purchase—hasn't arrived yet.",
                "That changes in 1979, when VisiCalc transforms the Apple II from a hobby toy into a business tool."
              ],
              "dialogues": [
                {
                  "speaker": "Girl",
                  "text": "Look, Dad! I typed 'PRINT 10+20' and it said '30'! The computer does math!"
                },
                {
                  "speaker": "Father",
                  "text": "That's great, honey. But I still don't see what I'd use it for..."
                }
              ],
              "nextScene": "scene-5-3-3"
            },
            {
              "id": "scene-5-3-3",
              "type": "narrative",
              "setting": {
                "text": "1979. Dan Bricklin has an idea: a visible calculator. A grid of numbers that recalculates automatically when you change any value."
              },
              "narrative": [
                "Bricklin is an MBA student at Harvard. He watches his professor laboriously recalculate a financial model, erasing and rewriting numbers on the blackboard.",
                "What if the blackboard could calculate itself? What if changing one number automatically updated all the numbers that depended on it?",
                "VisiCalc—the visible calculator—creates the spreadsheet. Suddenly, the Apple II isn't a toy. It's a business machine that pays for itself."
              ],
              "characters": [
                {
                  "avatar": "📊",
                  "name": "Dan Bricklin",
                  "title": "Co-creator, VisiCalc",
                  "bio": "The MBA student who invented the spreadsheet. Bricklin's insight—that computers could automate the tedious recalculation of financial models—created a new category of software and justified personal computer purchases.",
                  "stats": [
                    {
                      "label": "Innovation",
                      "value": "Electronic spreadsheet"
                    },
                    {
                      "label": "Impact",
                      "value": "The first 'killer app'"
                    }
                  ]
                }
              ],
              "technicalNotes": [
                {
                  "content": "VisiCalc ran on an Apple II with 32KB of RAM. The maximum spreadsheet was 63 columns × 254 rows. It calculated in real-time as you typed, automatically propagating changes through dependent cells. This real-time feedback, enabled by the Apple II's immediate-mode BASIC and fast display, made spreadsheets intuitive.",
                  "codeSnippet": "// VisiCalc fundamentals\n// \n// Cell reference: A1, B2, C3, etc.\n// Formula: +A1+B1 (add two cells)\n// Automatic recalculation\n// \n// Business example:\n// A1: Revenue    = 100000\n// A2: Costs      = 60000\n// A3: Profit     = +A1-A2 (automatically = 40000)\n// \n// Change A1 → A3 updates instantly"
                }
              ],
              "nextScene": "scene-5-3-4"
            },
            {
              "id": "scene-5-3-4",
              "type": "choice",
              "setting": {
                "text": "The personal computer era is in full swing. Different machines, different communities, different possibilities. Where do you focus?"
              },
              "narrative": [
                "The Apple II dominates education and business. CP/M machines rule professional computing. Game consoles and home computers blur together.",
                "Each ecosystem has its strengths. Each teaches different lessons."
              ],
              "choices": [
                {
                  "id": "choice-apple-ecosystem",
                  "icon": "🍎",
                  "title": "Explore the Apple Ecosystem",
                  "description": "Color graphics, game programming, Applesoft BASIC. The visual, creative side of personal computing.",
                  "nextScene": "scene-5-3-4a"
                },
                {
                  "id": "choice-cpm-world",
                  "icon": "💾",
                  "title": "Enter the CP/M World",
                  "description": "WordStar, dBASE, business software. The professional, productivity-focused path.",
                  "nextScene": "scene-5-3-4b"
                },
                {
                  "id": "choice-game-machines",
                  "icon": "🎮",
                  "title": "Master Game Machine Programming",
                  "description": "Atari 2600, ColecoVision, pushing hardware to its limits for entertainment.",
                  "nextScene": "scene-5-3-4c"
                }
              ],
              "nextScene": "scene-5-3-5"
            },
            {
              "id": "scene-5-3-4a",
              "type": "dialogue",
              "setting": {
                "text": "An Apple II with color monitor displays a lo-res graphics program. Blocks of color form simple animations on the 40x48 grid."
              },
              "dialogues": [
                {
                  "speaker": "Wozniak",
                  "text": "The Apple II is the first personal computer with color. I added it because I wanted to play Breakout. Turns out color changes everything—education, games, visualization."
                },
                {
                  "speaker": "You",
                  "text": "How do you program graphics in BASIC?"
                },
                {
                  "speaker": "Wozniak",
                  "text": "GR switches to graphics mode. COLOR= sets the drawing color. PLOT X,Y draws a point. HLIN and VLIN draw lines. With 16 colors and 40x48 resolution, you can create anything your imagination allows."
                }
              ],
              "technicalNotes": [
                {
                  "content": "Apple II's lo-res graphics used a clever memory mapping: each byte in screen memory represented two vertically adjacent pixels. The 16 colors included an artifact of NTSC television—purple and green appeared differently on color TVs than intended.",
                  "codeSnippet": "// Apple II Lo-Res graphics\n// \n// 10 GR           : REM Switch to graphics\n// 20 FOR I=0 TO 15\n// 30   COLOR= I   : REM Set color (0-15)\n// 40   VLIN 0,47 AT I*2  : REM Vertical bar\n// 50 NEXT I\n// \n// Resolution: 40x48 (lo-res), 280x192 (hi-res)\n// Colors: 16 lo-res, 6 hi-res\n// Memory: $400-$7FF screen RAM"
                }
              ],
              "nextScene": "scene-5-3-5"
            },
            {
              "id": "scene-5-3-4b",
              "type": "dialogue",
              "setting": {
                "text": "A CP/M business terminal. The A> prompt awaits. A stack of floppy disks holds WordStar, dBASE II, and Multiplan."
              },
              "dialogues": [
                {
                  "speaker": "Business User",
                  "text": "CP/M is serious computing. WordStar for documents. dBASE for customer records. Multiplan for budgets. My small business runs on this machine."
                },
                {
                  "speaker": "You",
                  "text": "What makes CP/M professional?"
                },
                {
                  "speaker": "Business User",
                  "text": "Standardization. Any CP/M software runs on any CP/M machine. I'm not locked into Apple or Commodore. When a better Z80 machine comes out, I just move my disks. That portability is worth everything."
                }
              ],
              "technicalNotes": [
                {
                  "content": "CP/M's BIOS abstraction enabled software portability across hundreds of different machines. The TPA (Transient Program Area) started at 0100h, leaving the first 256 bytes for system communication. This memory map influenced MS-DOS and persists in x86 architecture.",
                  "codeSnippet": "// CP/M system calls (BDOS)\n// \n// C register = function number\n// DE = parameter\n// CALL 0005h = invoke BDOS\n// \n// Common functions:\n// C=2: Print character in E\n// C=9: Print string at DE ($-terminated)\n// C=15: Open file (FCB at DE)\n// C=20: Read sequential record\n// \n// Portable across all CP/M machines!"
                }
              ],
              "nextScene": "scene-5-3-5"
            },
            {
              "id": "scene-5-3-4c",
              "type": "dialogue",
              "setting": {
                "text": "An Atari 2600 development kit. The console has only 128 bytes of RAM, yet games like Pitfall! create compelling adventures."
              },
              "dialogues": [
                {
                  "speaker": "Game Developer",
                  "text": "The 2600 has 128 bytes of RAM. Not kilobytes—bytes. Everything must fit in 128 bytes. Yet we create characters, scores, game state, collision detection. Every byte has three jobs."
                },
                {
                  "speaker": "You",
                  "text": "How is that even possible?"
                },
                {
                  "speaker": "Game Developer",
                  "text": "Racing the beam. The TV draws 262 lines per frame. We compute each line just before it's drawn—reusing the same variables 262 times per frame. The limitations force creativity. Constraints breed innovation."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The Atari 2600's TIA chip had no frame buffer—programmers had to update sprite positions in real-time as the electron beam scanned the TV. 'Racing the beam' meant code had to execute in exact sync with the 15,734 Hz horizontal scan rate.",
                  "codeSnippet": "// Atari 2600 racing the beam\n// \n// Memory: 128 bytes RAM\n// Sprites: 2 players, 2 missiles, 1 ball\n// Background: 40 pixels per line (repeated)\n// \n// Each scanline (76 cycles):\n//   WSYNC       ; Wait for horizontal blank\n//   LDA GFX,X   ; Load this line's graphics\n//   STA GRP0    ; Update player 0\n//   LDA COLORS  ; Load color for this line\n//   STA COLUP0  ; Set player color\n//   DEX         ; Next line\n//   BNE LOOP    ; Continue drawing"
                }
              ],
              "nextScene": "scene-5-3-5"
            },
            {
              "id": "scene-5-3-5",
              "type": "challenge",
              "setting": {
                "text": "Your final 8-bit challenge: build a complete application that demonstrates the Micro8's capabilities."
              },
              "narrative": [
                "The 8-bit era proved that personal computers were viable. Now, build something that showcases everything you've learned: registers, stack, subroutines, memory management."
              ],
              "challenge": {
                "title": "BUILD A COMPLETE 8-BIT APPLICATION",
                "objectives": [
                  {
                    "id": "obj-1",
                    "text": "Implement a simple text editor or calculator",
                    "completed": false
                  },
                  {
                    "id": "obj-2",
                    "text": "Use subroutines for modular code organization",
                    "completed": false
                  },
                  {
                    "id": "obj-3",
                    "text": "Handle user input through a loop",
                    "completed": false
                  },
                  {
                    "id": "obj-4",
                    "text": "Format output for display",
                    "completed": false
                  },
                  {
                    "id": "obj-5",
                    "text": "Add at least one 'feature' beyond the minimum",
                    "completed": false
                  }
                ]
              },
              "technicalNotes": [
                {
                  "content": "Complete applications in the 8-bit era required careful architecture: main loop, input handling, command parsing, output formatting, and error recovery—all in limited memory. The discipline of building complete, usable software in constraints shaped a generation of programmers.",
                  "codeSnippet": "// Typical 8-bit application structure\n// \n// INIT:\n//   Initialize hardware\n//   Clear memory\n//   Display welcome\n// \n// MAINLOOP:\n//   CALL get_input\n//   CALL parse_command\n//   CALL execute_command\n//   CALL display_result\n//   JMP MAINLOOP\n// \n// Subroutines maintain their own state\n// Stack enables clean call/return"
                }
              ],
              "nextScene": "scene-5-3-6"
            },
            {
              "id": "scene-5-3-6",
              "type": "dialogue",
              "setting": {
                "text": "Your application runs. It's simple, but complete—a real program that does something useful."
              },
              "dialogues": [
                {
                  "speaker": "Wozniak",
                  "text": "You've graduated from the 8-bit school. You understand registers, stacks, subroutines, memory. You can make these machines dance."
                },
                {
                  "speaker": "You",
                  "text": "But 64KB still feels limiting. What happens when programs grow larger?"
                },
                {
                  "speaker": "Wozniak",
                  "text": "Then we need bigger addresses. Sixteen bits of address gives you 64KB. What if we use twenty bits? A megabyte of address space. The 16-bit era is coming."
                },
                {
                  "speaker": "Jobs",
                  "text": "And with more memory comes more possibility. Word processors that handle real documents. Spreadsheets that model entire businesses. Graphics that look like photographs."
                }
              ],
              "narrative": [
                "The 8-bit era democratized computing. For the first time, individuals could own computers—not rent time on shared mainframes, not submit batch jobs, but sit at a keyboard and interact directly.",
                "The Apple II, Commodore PET, TRS-80: the trinity of 1977. Each powered by an 8-bit processor, each costing less than a few thousand dollars. The personal computer revolution had begun.",
                "But there's another story to tell: the Z80 that powers the TRS-80 and countless other machines, and the operating system that made business computing possible."
              ],
              "nextScene": "chapter-5-4"
            }
          ]
        },
        {
          "id": "chapter-5-4",
          "number": 4,
          "title": "The Operating System",
          "subtitle": "Gary Kildall and CP/M",
          "year": "1974-1980",
          "scenes": [
            {
              "id": "scene-5-4-1",
              "type": "narrative",
              "setting": {
                "text": "Zilog Corporation, Los Gatos, California, 1976. Former Intel engineers have created something remarkable: the Z80, an 8080-compatible chip that does everything better—and at a lower price."
              },
              "narrative": [
                "Federico Faggin left Intel over disputes about credit for the 4004. At his new company Zilog, he and his team design the Z80: fully compatible with Intel's 8080 but dramatically improved.",
                "The Z80 has twice as many registers, including index registers for easier array access. It has a better interrupt system, block move instructions, and a single +5V power supply instead of the 8080's three voltage rails.",
                "Most importantly, it costs less than the 8080. The Z80 will power more machines than any other 8-bit processor: TRS-80, Sinclair ZX Spectrum, MSX, countless CP/M business computers."
              ],
              "characters": [
                {
                  "avatar": "💎",
                  "name": "Federico Faggin",
                  "title": "Co-founder, Zilog",
                  "bio": "The father of the microprocessor, now building Intel's competitor. Faggin designed the Z80 to be everything the 8080 should have been: more registers, better instructions, simpler power requirements.",
                  "stats": [
                    {
                      "label": "Z80 Registers",
                      "value": "18 total (vs 8080's 7)"
                    },
                    {
                      "label": "Market Share",
                      "value": "Dominated 8-bit business computing"
                    }
                  ]
                },
                {
                  "avatar": "🔧",
                  "name": "Masatoshi Shima",
                  "title": "Co-designer, Z80",
                  "bio": "The Japanese engineer who co-designed both the 4004 and Z80. Shima's meticulous attention to detail made the Z80 one of the most reliable processors ever manufactured.",
                  "stats": [
                    {
                      "label": "Achievement",
                      "value": "Two revolutionary CPUs"
                    },
                    {
                      "label": "Legacy",
                      "value": "Z80 still in production today"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Faggin",
                  "text": "Intel won't give us credit for the 4004? Fine. We'll build something better. The Z80 runs all 8080 software, but it's what the 8080 should have been."
                }
              ],
              "technicalNotes": [
                {
                  "content": "The Z80's innovations included: shadow registers (instant context switch), IX/IY index registers (simplified array access), block I/O instructions (LDIR, LDDR for fast memory copy), and a cleaner interrupt system. It remained in production for over 40 years.",
                  "codeSnippet": "// Z80 improvements over 8080\n// \n// Index registers:\n// LD A, (IX+5)    ; Array access with offset\n// \n// Block moves:\n// LDIR            ; Copy BC bytes from HL to DE\n// \n// Shadow registers:\n// EX AF, AF'      ; Swap to alternate register set\n// EXX             ; Swap BC, DE, HL with shadows\n// \n// Single +5V supply (8080 needed +5, -5, +12V)"
                }
              ],
              "nextScene": "scene-5-4-2"
            },
            {
              "id": "scene-5-4-2",
              "type": "narrative",
              "setting": {
                "text": "Pacific Grove, California, 1974. Gary Kildall, a computer science professor at the Naval Postgraduate School, is frustrated. He has an Intel development system with a floppy disk drive, but no way to use disks with his microprocessor programs."
              },
              "narrative": [
                "Kildall writes his own disk operating system—a program to manage files, load programs, and provide a consistent interface to storage hardware. He calls it CP/M: Control Program for Microcomputers.",
                "CP/M does something revolutionary: it separates the hardware-specific code into a 'BIOS' that can be customized for each machine, while the rest of the operating system stays the same. Write software for CP/M, and it runs on any CP/M machine.",
                "This is the first portable operating system for microcomputers. It will become the standard for business computing—until IBM enters the market."
              ],
              "characters": [
                {
                  "avatar": "💿",
                  "name": "Gary Kildall",
                  "title": "Founder, Digital Research",
                  "bio": "The inventor of CP/M and arguably the father of the PC software industry. Kildall created the first microcomputer operating system, the first BIOS architecture, and the first portable business software platform.",
                  "stats": [
                    {
                      "label": "Innovation",
                      "value": "CP/M, BIOS concept"
                    },
                    {
                      "label": "Tragedy",
                      "value": "Lost IBM deal to Microsoft"
                    }
                  ]
                }
              ],
              "dialogues": [
                {
                  "speaker": "Kildall",
                  "text": "Every computer has different hardware—different disk controllers, different serial ports. But if I abstract that into a BIOS layer, software doesn't need to know. Write once, run anywhere."
                }
              ],
              "technicalNotes": [
                {
                  "content": "CP/M introduced concepts still used today: the command line interface, the file system with directory structure, the BIOS abstraction layer, and memory-resident system services. MS-DOS was heavily inspired by CP/M—Microsoft even licensed a CP/M clone (86-DOS) as its basis.",
                  "codeSnippet": "// CP/M architecture\n// \n// Memory map:\n// 0000-00FF: System parameters\n// 0100-xxxx: TPA (Transient Program Area)\n// xxxx-BDOS: CP/M system calls\n// BDOS-BIOS: Hardware abstraction\n// BIOS-FFFF: Hardware-specific code\n// \n// Application calls BDOS (portable)\n// BDOS calls BIOS (machine-specific)\n// Result: Portable software!"
                }
              ],
              "nextScene": "scene-5-4-3"
            },
            {
              "id": "scene-5-4-3",
              "type": "narrative",
              "setting": {
                "text": "A law office, 1979. Stacks of paper cover every surface. The firm just bought a Z80-based computer running CP/M, along with a program called WordStar. Everything is about to change."
              },
              "narrative": [
                "WordStar transforms the practice of law. Documents that took days to type, retype, and retype again can now be edited on screen. Find and replace. Copy and paste. Spelling correction.",
                "The lawyer dictates changes. The secretary edits the file. The document prints perfectly, every time. No retyping. No white-out. No carbon copies.",
                "This is the killer app for CP/M business machines. WordStar proves that personal computers aren't toys—they're tools that transform how work gets done."
              ],
              "dialogues": [
                {
                  "speaker": "Secretary",
                  "text": "I used to retype this contract three times for every revision. Now I change a few lines and print. I go home at 5 PM instead of 8 PM."
                },
                {
                  "speaker": "Lawyer",
                  "text": "And the billable hours I save on clerical work? I can handle twice as many clients. The computer paid for itself in a month."
                }
              ],
              "technicalNotes": [
                {
                  "content": "WordStar (1978) became the best-selling software program in the world. Its keyboard commands (Ctrl-K for block operations, Ctrl-Q for quick movement) were memorized by millions. Many writers, including George R.R. Martin, still use WordStar or WordStar-compatible editors today.",
                  "codeSnippet": "// WordStar commands (still used in some editors)\n// \n// Ctrl-K B  Mark block begin\n// Ctrl-K K  Mark block end\n// Ctrl-K C  Copy block\n// Ctrl-K V  Move block\n// Ctrl-K Y  Delete block\n// \n// Ctrl-Q F  Find\n// Ctrl-Q A  Find and replace\n// \n// ^K S      Save file\n// ^K D      Save and exit"
                }
              ],
              "nextScene": "scene-5-4-4"
            },
            {
              "id": "scene-5-4-4",
              "type": "dialogue",
              "setting": {
                "text": "Digital Research headquarters, 1980. Gary Kildall has built CP/M into a multi-million dollar business. Then IBM calls."
              },
              "dialogues": [
                {
                  "speaker": "Kildall",
                  "text": "IBM wants an operating system for their new personal computer. This is the moment we've been waiting for—the biggest computer company in the world, choosing CP/M."
                },
                {
                  "speaker": "You",
                  "text": "What happened with the IBM deal?"
                },
                {
                  "speaker": "Kildall",
                  "text": "They came when I was out flying. My wife Dorothy met with them but wouldn't sign their non-disclosure agreement—the terms were unreasonable. IBM got impatient. They went to Microsoft instead."
                },
                {
                  "speaker": "You",
                  "text": "But Microsoft didn't have an operating system..."
                },
                {
                  "speaker": "Kildall",
                  "text": "They bought one. A CP/M clone called 86-DOS. Renamed it MS-DOS. Got a deal where they could license it to anyone—not just IBM. The rest... the rest is history."
                }
              ],
              "narrative": [
                "The Z80 and CP/M dominated business computing until IBM chose a different path. But their influence persists: the Z80's architecture influenced later designs, and CP/M's concepts—command lines, file systems, BIOS abstraction—live on in every PC.",
                "Gary Kildall never recovered from losing the IBM deal. He died in 1994, largely forgotten by an industry he helped create. But without CP/M, there would have been no DOS. Without the Z80, no affordable business computers.",
                "The 8-bit era proved that personal computing could be serious. But 64KB wasn't enough for serious work. The 16-bit era beckoned—with promises of megabytes of memory and IBM's blessing.",
                "Continue to Act 6: The 16-bit Era."
              ]
            }
          ]
        }
      ],
      "mindset": {
        "year": 1977,
        "knownTechnology": [
          "8-bit microprocessor",
          "8080",
          "Z80",
          "6502",
          "RAM chip",
          "BASIC interpreter",
          "cassette tape storage"
        ],
        "unknownTechnology": [
          "16-bit personal computer",
          "hard drive for home use",
          "internet",
          "smartphone",
          "flash memory",
          "CD-ROM",
          "touchscreen"
        ],
        "activeProblems": [
          {
            "statement": "How do we make computers affordable for hobbyists?",
            "motivation": "The Altair proved theres a market, but $1000 for a kit is still expensive for many."
          },
          {
            "statement": "What software does a home computer need?",
            "motivation": "Business needs are understood, but what do hobbyists actually want to do?"
          }
        ],
        "constraints": [
          {
            "type": "technical",
            "description": "64KB address space maximum",
            "limitation": "Programs must fit in kilobytes"
          },
          {
            "type": "material",
            "description": "RAM is expensive",
            "limitation": "Most machines ship with 4-16KB"
          },
          {
            "type": "economic",
            "description": "Home computer market is unproven",
            "limitation": "VCs are skeptical about consumer demand"
          }
        ],
        "impossibilities": [
          "multimedia applications",
          "megabytes of RAM",
          "gigahertz processors",
          "wireless connectivity"
        ],
        "historicalPerspective": {
          "currentKnowledge": "You are in the dawn of personal computing. The Apple II, TRS-80, and Commodore PET have just launched. BASIC is the language everyone learns. Floppy disks are expensive luxuries. Bill Gates and Paul Allen just moved Microsoft from Albuquerque to Seattle.",
          "futureBlind": "You cannot know if the personal computer market will survive. Critics say its a fad for hobbyists. Will regular people ever need computers at home? What would they even use them for?"
        }
      }
    }
  ]
}
